Terraform plan for __staging__
<details>
  <summary>Plan: 17 to add, 0 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_dns_record_set.ibo_redis_a_record will be created
  + resource "google_dns_record_set" "ibo_redis_a_record" {
      + id           = (known after apply)
      + managed_zone = "ebo-staging-private-dns-managed-zone"
      + name         = "ibo.redis.commerce.internal."
      + project      = (known after apply)
      + rrdatas      = [
          + (known after apply),
        ]
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.inventory_redis_a_record will be destroyed
  - resource "google_dns_record_set" "inventory_redis_a_record" {
      - id           = "projects/ebo-staging/managedZones/ebo-staging-private-dns-managed-zone/rrsets/inventory.redis.commerce.internal./A" -> null
      - managed_zone = "ebo-staging-private-dns-managed-zone" -> null
      - name         = "inventory.redis.commerce.internal." -> null
      - project      = "ebo-staging" -> null
      - rrdatas      = [
          - "10.100.0.3",
        ] -> null
      - ttl          = 300 -> null
      - type         = "A" -> null
    }

  # kubernetes_secret.logistics_app_secret will be created
  + resource "kubernetes_secret" "logistics_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "logistics-db-secrets"
          + namespace        = "logistics-service"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.nodemaster_app_secret will be created
  + resource "kubernetes_secret" "nodemaster_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "nodemaster-db-secrets"
          + namespace        = "node-master"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.orderservice_app_secret will be created
  + resource "kubernetes_secret" "orderservice_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "orderservice-db-secrets"
          + namespace        = "order-service"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # random_string.logistics_user_password will be created
  + resource "random_string" "logistics_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.nodemaster_user_password will be created
  + resource "random_string" "nodemaster_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.orderservice_user_password will be created
  + resource "random_string" "orderservice_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # module.ibo_redis.google_redis_instance.cache will be created
  + resource "google_redis_instance" "cache" {
      + alternative_location_id  = (known after apply)
      + auth_enabled             = false
      + auth_string              = (sensitive value)
      + authorized_network       = "https://www.googleapis.com/compute/v1/projects/ebo-staging/global/networks/ebo-staging-network"
      + connect_mode             = "DIRECT_PEERING"
      + create_time              = (known after apply)
      + current_location_id      = (known after apply)
      + host                     = (known after apply)
      + id                       = (known after apply)
      + location_id              = (known after apply)
      + memory_size_gb           = 1
      + name                     = "ibo-redis"
      + persistence_iam_identity = (known after apply)
      + port                     = (known after apply)
      + project                  = (known after apply)
      + redis_version            = "REDIS_6_x"
      + region                   = "asia-south1"
      + reserved_ip_range        = "10.100.0.0/24"
      + server_ca_certs          = (known after apply)
      + tier                     = "BASIC"
      + transit_encryption_mode  = "DISABLED"
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["logistics"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "ibo-stg-db-c06501dd"
      + name      = "logistics"
      + project   = "ebo-staging"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["nodemaster"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "ibo-stg-db-c06501dd"
      + name      = "nodemaster"
      + project   = "ebo-staging"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["orderservice"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "ibo-stg-db-c06501dd"
      + name      = "orderservice"
      + project   = "ebo-staging"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["logistics-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "ibo-stg-db-c06501dd"
      + name     = "logistics-user"
      + password = (sensitive value)
      + project  = "ebo-staging"
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["nodemaster-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "ibo-stg-db-c06501dd"
      + name     = "nodemaster-user"
      + password = (sensitive value)
      + project  = "ebo-staging"
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["orderservice-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "ibo-stg-db-c06501dd"
      + name     = "orderservice-user"
      + password = (sensitive value)
      + project  = "ebo-staging"
    }

  # module.inventory_google_postgres.random_id.additional_passwords["logistics-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "name" = "ibo-stg-db-c06501dd"
        }
    }

  # module.inventory_google_postgres.random_id.additional_passwords["nodemaster-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "name" = "ibo-stg-db-c06501dd"
        }
    }

  # module.inventory_google_postgres.random_id.additional_passwords["orderservice-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "name" = "ibo-stg-db-c06501dd"
        }
    }

  # module.inventory_redis.google_redis_instance.cache will be destroyed
  - resource "google_redis_instance" "cache" {
      - auth_enabled             = false -> null
      - authorized_network       = "projects/ebo-staging/global/networks/ebo-staging-network" -> null
      - connect_mode             = "DIRECT_PEERING" -> null
      - create_time              = "2021-09-27T04:35:32.827309972Z" -> null
      - current_location_id      = "asia-south1-a" -> null
      - host                     = "10.100.0.3" -> null
      - id                       = "projects/ebo-staging/locations/asia-south1/instances/inventory-redis" -> null
      - labels                   = {} -> null
      - location_id              = "asia-south1-a" -> null
      - memory_size_gb           = 1 -> null
      - name                     = "inventory-redis" -> null
      - persistence_iam_identity = "serviceAccount:35727718622-compute@developer.gserviceaccount.com" -> null
      - port                     = 6379 -> null
      - project                  = "ebo-staging" -> null
      - redis_configs            = {} -> null
      - redis_version            = "REDIS_5_0" -> null
      - region                   = "asia-south1" -> null
      - reserved_ip_range        = "10.100.0.0/24" -> null
      - server_ca_certs          = [] -> null
      - tier                     = "BASIC" -> null
      - transit_encryption_mode  = "DISABLED" -> null
    }

Plan: 17 to add, 0 to change, 2 to destroy.

Warning: Provider helm is undefined

  on istio_telemetry_gke.tf line 27, in module "istio_telemetry_proxy":
  27:     helm = helm.gke

Module module.istio_telemetry_proxy does not declare a provider named helm.
If you wish to specify a provider configuration for the module, add an entry
for helm in the required_providers block within the module.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

Plan generated in [Terraform #235](https://github.com/ebomart/commerce-infrastructure/actions/runs/1311845729)